{"keras_version": "2.1.4", "backend": "cntk", "config": [{"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_regularizer": null, "kernel_size": [3, 3], "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_1", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_2", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "units": 128, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.5, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "units": 10, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}